/*==============================================================*/
/* wms1.4.1数据库修改                                           */
/*==============================================================*/

USE wms;

/*==============================================================*/
/* wms配送范围添加字段：省份名称，市级名称                      */
/*==============================================================*/
ALTER TABLE wms.t_order_logistics_info
ADD area_code INTEGER(6) DEFAULT NULL COMMENT '县区编码',
ADD area_name VARCHAR(50) DEFAULT NULL COMMENT '县区名称';

/*==============================================================*/
/* wms运费单删除运单号唯一索引：logistics_no_index              */
/*==============================================================*/
ALTER TABLE t_logistics_freight_bill DROP INDEX logistics_no_index;
